№ 2
Может ли быть определено число итераций цикла for до начала его выполнения?
(Да,может)

----------------------------------------------------------------------------

№ 3
Верно ли решена задача: «найти сумму первых 100 натуральных чисел»?
a) i = 1; sum = 0;
    for ( ; i <= 100; i++) sum += i;

    (Верно)

b) sum = 0;
    for ( i = 1; i <= 100;) sum += i++;

    (Верно)

c) for ( i = 1, sum = 0; i <= 100; sum += i+,  i++);

    (Не верно)

d) for ( i = 1, sum = 0; i <= 100; sum += i++);

    (Верно)

e) for ( i = 0, sum = 0; i++, i <= 100; sum += i);

    (Не верно)

----------------------------------------------------------------------------

№ 4
Выразить семантику цикла for с помощью цикла while. Эквивалентны ли полученные фрагменты программ?
for(i=0; i<n; i++)
i=0; while(i<n){
    i++
}
(Эквиваленты)

-----------------------------------------------------------------------------

№ 5
Эквивалентны ли следующие фрагменты программы:
a) 	for ( ; e2 ; ) S;		и			while ( e2 ) S; (эквиваленты)
b) 	for ( ; ; ) S;			и			while (1) S; (эквиваленты)

-----------------------------------------------------------------------------

№ 6
Улучшить стиль (структуру) следующих фрагментов программы на Си:
	a) while ( E1 )
	{ if ( E2 ) continue; S; }

    (while ( E1 ) if ( !E2 ) S;)

	b) do  { if ( E1 ) continue; else S1; S2; }
	while ( E2 );

    (do { 
    if ( !E1 ) 
        { 
        S1; 
        S2; 
        }
    }
    while ( E2 );)
	Замечание: здесь E1, E2 - выражения допустимого в этом случае типа; S, S1, S2 - произвольные операторы.

--------------------------------------------------------------------------------

№ 7
# include <stdio.h>
main()
{ int x, y, z;
x = y = 0;
while ( y < 10 ) ++y; x += y;
printf ("x = %d y = %d\n", x, y);
x = y = 0;
while ( y < 10 ) x += ++ y;
printf (" x= %d y = %d\n", x, y);
y = 1;
while ( y < 10 ) { x = y ++; z = ++y;}
printf ("x = %d y = %d z = %d\n", x, y, z);
for ( y =1; y < 10; y++ ) x = y;
printf (" x= %d y = %d\n", x, y);
for ( y = 1; ( x = y ) < 10; y++ );
printf ("x = %d y = %d\n", x, y);
for ( x = 0, y = 1000; y > 1; x++, y /= 10 )
printf ("x = %d y = %d\n", x, y);
}

Ответ:
(x = 10 y = 10
x= 55 y = 10
x = 9 y = 11 z = 11
x= 9 y = 10
x = 10 y = 10
x = 0 y = 1000
x = 1 y = 100
x = 2 y = 10)

------------------------------------------------------------------------------------

№ 8
Верно ли утверждение: « действие оператора continue; в приведенных ниже примерах эквивалентно действию оператора goto next; ».
a) 	while ( E ) { S; ... continue; ... S; next: ; } (да)
b) 	do { S; ... continue; ... S; } while ( E ); next: ; ... (нет)
c) 	for ( E1; E2; E3) { S; ... continue; ... S; next: ; } (да)
d) 	while ( E) { S; ... for (E1;E2;E3) { S; ... continue; ... S; } ... S; next:; } (нет)
e) 	while ( E) { S; ... for (E1;E2;E3) { S; ... continue; ... S; next: ; } ... S;} (да)
	Замечание: здесь E, E1, E2, E3 - выражения допустимого в этом случае типа ; S - произвольный оператор.
  
------------------------------------------------------------------------------------

№ 9
Верно ли утверждение: « действие оператора break; в приведенных ниже примерах эквивалентно действию оператора goto next; ».
	a) while ( E ) { S; ... break; ... S; next: ; } (нет)
	b) while ( E ) { S; ... break; ... S; } next: ; ... (да)
	c) do { S; ... break; ... S; } while ( E ); next: ; ... (да)
	d) for ( E1; E2; E3) { S; ... break; ... S; next: ; } (нет)
	e) while ( E) { S; ... for ( E1; E2; E3) { S; ... break; ... S; } next: ; ... S; } (да)
	f) while ( E ) { S; ... for ( E1; E2; E3) { S; ... break; ... S; } ... S; next: ; } (нет)
	Замечание: здесь E, E1, E2, E3 - выражения допустимого в этом случае типа; S - произвольный оператор.

------------------------------------------------------------------------------------

№ 1
1.	Подсчитать количество натуральных чисел n ( 111 <= n <= 999 ), в записи которых есть 
а) две одинаковые цифры;

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    int i,sum,a,b,c;
    sum=0;
    for (i=111;i<1000;i++)
    {
        a=i%10;
        b=i/10%10;
        c=i/100;
        if (a==b || b==c || c==a)
            sum++;
    }
        printf("%d",sum);
    return 0;
}

b) только две одинаковые цифры

------------------------------------------------------------------------------------

№ 2
Подсчитать количество натуральных чисел n ( 102 <= n <= 987 ), в которых все три цифры различны.

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    int i,sum,a,b,c;
    sum=0;
    for (i=102;i<988;i++)
    {
        a=i%10;
        b=i/10%10;
        c=i/100;
        if (a!=b || b!=c || c!=a)
            sum++;
    }
        printf("%d",sum);
    return 0;
}

----------------------------------------------------------------------------------------

№ 3
Подсчитать количество натуральных чисел n ( 11 <= n <= 999 ), являющихся палиндромами, и распечатать их.

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    int i;
    for (i=11;i<1000;i++)
    if (i < 100 && i / 10 == i % 10)
            printf("%d\n", i);
        else if (i > 100 && i / 100 == i % 10)
            printf("%d\n", i);
    return 0;
}

-----------------------------------------------------------------------------------------

№ 4
Подсчитать количество цифр в десятичной записи целого неотрицательного числа n.

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    int n, c = 0;
    scanf("%d", &n);
    while (n > 0){
        c++;
        n /= 10;
    }
    printf("%d",c);
    return 0;
}

--------------------------------------------------------------------------------------------

№ 5
Определить, верно ли, что куб суммы цифр натурального числа n равен n2.

#include <stdio.h>

int main()
{
    int n, square, cube, sum = 0;
    scanf("%d", &n);
    square = n * n;
    while (n > 0){
        sum = sum + (n % 10);
        n /= 10;
    }
    cube = sum * sum * sum;
    if (cube == square)
        printf("True");
    else
        printf("False");
    return 0;
}

--------------------------------------------------------------------------------------------

№ 6
Определить, является ли натуральное число n степенью числа 3.

#include <stdio.h>

int main()
{
    int n;
    scanf("%d", &n);
    while (n % 3 == 0)
        n /= 3;
    if (n == 1)
        printf("Да");
    else
        printf("Нет");
    return 0;
}

--------------------------------------------------------------------------------------------

№ 7

Для данного вещественного числа a найти наименьшее натуральное число n, такое что сумма 1 + (1/2) + (1/3)+ . . . + (1/n) будет большее числа a.

#include <stdio.h>

int main()
{
    int n = 1;
    float a, count = 1.0;
    scanf("%f", &a);
    while (count < a) {
        n++;
        count = count + (1.0 / n);
    }
    printf("%d", n);
    return 0;
}

---------------------------------------------------------------------------------------------

№ 8
Для данного вещественного положительного числа a найти наименьшее натуральное положительное n такое, что 1 + 1/2 +1/3+ ... + 1/n > a.

#include <stdio.h>

int main()
{
    int n = 1;
    float a, count = 1.0;
    scanf("%f", &a);
    while (count < a) {
        n++;
        count = count + (1.0 / n);
    }
    printf("%d", n);
    return 0;
}

---------------------------------------------------------------------------------------------

№ 9
Дано натуральное число n. Найти значение числа, полученного следующим образом: из записи числа n выбросить цифры 0 и 5, оставив прежним порядок остальных цифр.

#include <stdio.h>
 
int main( void ){
    int n, a[15], i, k;
    scanf("%d", &n);
    k = 0;
    while (n){
        a[k] = n % 10;
        n /= 10;
        k++;
    } 
    n = 0;
    for (i = k - 1; i > -1; --i)
        if (a[i] != 0 && a[i] != 5)
            n = n * 10 + a[i];
    printf("%d", n);             
    return 0;
}

----------------------------------------------------------------------------------------------

№ 10
Дано натуральное число n. Получить все его натуральные делители.

#include <stdio.h>

int main()
{
    int n, i;
    scanf("%d", &n);
    for (i = 1; i <= n/2; i++)
        if (n % i==0)
            printf("%d ", i);
    printf("%d", n);
    return 0;
}

------------------------------------------------------------------------------------------------

№ 11
Дано натуральное число n. Получить все такие натуральные q, что n делится на q2 и не делится на q3.


#include <stdio.h>
 
int main(void)
{
    unsigned int n;
    scanf("%u", &n);
 
    unsigned int q = 2;
    while( 1 ) {
        unsigned int squared = q * q;
        unsigned int cubed = squared * q;
        if( cubed > n ) { break; }
        if( n % squared == 0 && n % cubed != 0 ) {
            printf("%u\n", q);
        }
        ++q;
    }
 
    return 0;
}


---------------------------------------------------------------------------------------------

№ 12
Дано целое число m > 1.Получить наибольшее целое k, при котором  4k < m.

#include <stdio.h>
 
int main()
{
    int m, k = 0, num = 1;
    printf("m>1: ");
    scanf("%d", &m);
    if (m <= 1){
        printf(">1");
        return 0;
    }
    while (num * 4 < m){
        num *= 4;
        k++;
    }
    printf("k = %d (%d)", k, num);
    return 0;
}

--------------------------------------------------------------------------------------------

№ 13
Распечатать первые n (n - задано) простых чисел (p - простое число, если p >= 2 и делится только на 1 и на себя).

#include <stdio.h>

int main()
{
    int n, i = 0, i1, k = 1, k1 = 0;
    scanf("%d", &n);
    while (n > i){
        k++;
        for (i1 = 1; i1 <= k; i1++)
            if (k % i1 == 0)
                k1++;
        if (k1 == 2){
            printf("%d ", k);
            i++;
        }
        k1 = 0;
    }
    return 0;
}

----------------------------------------------------------------------------------------------

№ 14
Распечатать первые n (n - задано) чисел Фибоначчи: 
f0 = 1; f1 = 1; fk+1 = fk-1+ fk; k = 1, 2, 3,...


#include <stdio.h>

int main()
{
    int n, i, f0 = 1, f1 = 1;
    printf("Enter n: ");
    scanf("%d", &n);
    printf("Pervye %d chisel Fibonachi: ", n);
    for (i=1; i<=n; i++){
        if (f0 >= f1) {
            printf("%d ", f1);
            f1 = f0 + f1;
        } else {
            printf("%d ", f0);
            f0 = f1 + f0;
        }
    }
    return 0;
}

---------------------------------------------------------------------------------------------

№ 15 
Вычислить значение E i! для i, изменяющихся от 1 до n. Воспользоваться соотношением Е i! = 1 + 1*2 + 1*2*3 +...+ 1*2*3*...*n = 1+2*(1+3*(1+   +n*(1)...)).

#include <stdio.h>

int main(){
    int i=0, n=0, fact=1, res=0;
    printf("Enter n: ");
    scanf("%d", &n);
    for(i = 1; i <= n; i++) {
        fact *= i;
        res += fact;
    }
    printf("%d ", res);
    return 0;
}

-------------------------------------------------------------------------------------------------------------------------------------

№ 16
Вычислить квадратные корни вещественных чисел x = 2.0, 3.0, ... , 100.0. Распечатать значения x, x. Количество итераций, необходимых для вычисления корня, определяется точностью eps > 0 (eps – задано).
Для a > 0 величина ^a вычисляется следующим образом:
a0 = 1; ai+1 = 0.5( ai+a/ai ) i = 0, 1, 2,...
Считать, что требуемая точность достигнута, если | ai-ai+1| < eps.

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main(){
    float x,a0,a1=1,eps=0.001;
    int i;
    for (x=2;x<=100;x++) {
        while (fabsf(a0-a1)>=eps){a0=a1; a1=(a0+x/a0)/2; i++;}
            printf("\nx=%f korx=%f i=%i",x,a1,i);
            a0=0;a1=1;
    }
}

-------------------------------------------------------------------------------------------------
№ 17 
Для данного вещественного числа x и натурального n вычислить:
	a) sin x + sin2x + ... + sinnx 
    
    #include <stdio.h>
    #include <stdlib.h>
    #include <math.h>

    int main(){
    float x,sum=0,fact=1;
    int n,i=1;
    scanf("%f %d",&x,&n);
    while (i<=n) {
        i++;
        fact*=sin(x);
        sum+=fact;
    }
    printf("sum=%f",sum);
    }

	b) sin x + sinx2 + ... + sinxn 

    #include <stdio.h>
    #include <stdlib.h>
    #include <math.h>

    int main(){
    float x,sum=0;
    int n,i=1;
    scanf("%f %d",&x,&n);
    while (i<=n) {
        sum+=sin(x*i);
        i++;
    }
    printf("sum=%f",sum);
    }

	c) sin x + sin(sin x ) + ... + sin ( sin (... sin(sin x) ... ))

    #include <stdio.h>
    #include <stdlib.h>
    #include <math.h>

    int main(){
    float x,sum=0,sinsin,res;
    int n,i=1;
    scanf("%f %d",&x,&n);
    res=x;
    while (i<=n) {
        sinsin=sin(res);
        res=sinsin;
        sum+=res;
        i++;
    }
    printf("sum=%f",sum);
    }   

------------------------------------------------------------------------------------------------

№ 18
Вычислить 1 - 1/2 + 1/3 - 1/4 + ...+1/9999 - 1/10000 следующими способами: 
	a). последовательно слева направо;

    #include <stdio.h>
    #include <stdlib.h>
    #include <math.h>

    int main(){
    long double sum=0,n=1;
    while (n<=10000) {sum+=1/n;n++;}
        printf("sum=%Lf\n",sum);
    }

	b). последовательно справа налево;

    #include <stdio.h>
    #include <stdlib.h>
    #include <math.h>

    int main(){
    long double sum=0,n=10000;
    while (n>=1) {sum+=1/n;n--;}
        printf("sum=%Lf\n",sum);
    }

	c). последовательно слева направо вычисляются 1 +1/3 + 1/5 + ... + 1/9999 и 1/2 + 1/4 + ... + 1/10000, затем второе значение вычитается из первого;
	
    #include <stdio.h>
    #include <stdlib.h>
    #include <math.h>

    int main(){
    long double sum=0,sum2=0,n=1;
    int i=1;
    while (n<=10000) {
        if ((i%2)==0) 
            sum+=1/n;
        else sum2+=1/n;
            n++;i++;
    }
    printf("sum=%Lf\n",sum2-sum);
    }

    d). последовательно справа налево вычисляются 1 +1/3 + 1/5 + ... + 1/9999 и 1/2 + 1/4 + ... + 1/10000, затем второе значение вычитается из первого.
	
    #include <stdio.h>
    #include <stdlib.h>
    #include <math.h>

    int main(){
    long double sum=0,sum2=0,n=10000;
    int i=10000;
    while (n>=1) {
        if ((i%2)==0)  
            sum+=1/n;
        else sum2+=1/n;
            n--;i--;
    }
    printf("sum=%Lf\n",sum2-sum);
    }   
    
    Сравнить и объяснить полученные результаты.

    (Нет разницы с какой стороны начинать отсчёт.)

------------------------------------------------------------------------------------------------

№ 19
Натуральное число называется совершенным, если оно равно сумме всех своих делителей, за исключением самого себя. Дано натуральное число n. Получить все совершенные числа, меньшие n.

#include <stdio.h>

int main()
{
    int n,i,j,sum;
    scanf("%d",&n);
    if (n>2){
        for(i=3;i<=n;i++){
            sum=0;
            for(j=1;j<=i-1;j++)
                if (i%j==0)
                    sum=sum+j;
            if(sum==i)
                printf("%d\n",i);
        }
    }
    return 0;
}

-------------------------------------------------------------------------------------------------

№ 20
Если p и q - простые числа и q = p+2, то они называются простыми сдвоенными числами или “близнецами” (twin primes). Например, 3 и 5 - такие простые числа. Распечатать все простые сдвоенные числа, меньшие N.

#include <stdio.h>

int main()
{
    int n,i,j,sum;
    scanf("%d",&n);
        for(i=2;i<=n;i++)
            for(j=2;j<i;j++){
                if (i%j==0)
                    break;
                else if(i==j+1)
                printf("%d\n",i);
            }
    return 0;
}
